# use this file for daily docs & assignments
# use subject files for notes only (they are not in agenda)

**** DONE <2023-11-29 Wed> docs: intro (prashant's notes)
:PROPERTIES:
:Copy_num: in messenger
:Page_range: 
:END:
:LOGBOOK:
CLOCK: [2023-11-29 Wed 16:59]--[2023-11-29 Wed 17:16] =>  0:17
CLOCK: [2023-11-29 Wed 15:31]--[2023-11-29 Wed 16:33] =>  1:02
CLOCK: [2023-11-29 Wed 14:16]--[2023-11-29 Wed 15:24] =>  1:08
CLOCK: [2023-11-29 Wed 13:28]--[2023-11-29 Wed 14:08] =>  0:40
:END:
**** DONE Digitize line w/ A(7,2) & B(1,7) using DDA
SCHEDULED: <2023-12-06 Wed>
:LOGBOOK:
CLOCK: [2023-12-06 Wed 18:41]--[2023-12-06 Wed 18:57] =>  0:16
:END:
**** DONE [#A] Derive 3 remaining BSA formulae :offline:
SCHEDULED: <2024-01-01 Mon 06:30> DEADLINE: <2024-01-02 Tue>
:LOGBOOK:
CLOCK: [2024-01-01 Mon 10:49]--[2024-01-01 Mon 11:59] =>  1:10
CLOCK: [2024-01-01 Mon 08:29]--[2024-01-01 Mon 09:06] =>  0:37
CLOCK: [2023-12-31 Sun 18:37]--[2023-12-31 Sun 19:05] =>  0:28
CLOCK: [2023-12-31 Sun 16:00]--[2023-12-31 Sun 17:01] =>  1:01
:END:
m +ve & > 1 // tips for this on pg. 125
m -ve & < 1
m -ve & > 1

- [ ] check online if formula for m - ve < 1 is correct 
  + [ ] try taking opposite d1 and d2?
    
**** DONE [#B] CG lab1 + 2 report
SCHEDULED: <2023-12-26 Tue> DEADLINE: <2023-12-26 Tue>
:LOGBOOK:
CLOCK: [2023-12-26 Tue 18:52]--[2023-12-26 Tue 21:02] =>  2:10
CLOCK: [2023-12-26 Tue 17:49]--[2023-12-26 Tue 18:15] =>  0:26
CLOCK: [2023-12-25 Mon 17:59]--[2023-12-25 Mon 18:30] =>  0:31
CLOCK: [2023-12-24 Sun 19:39]--[2023-12-24 Sun 20:11] =>  0:32
:END:
**** [#A] CG mid-point study :offline:
# SCHEDULED: <2023-12-26 Tue>
:LOGBOOK:
CLOCK: [2023-12-26 Tue 15:26]--[2023-12-26 Tue 16:43] =>  1:17
CLOCK: [2023-12-26 Tue 10:51]--[2023-12-26 Tue 12:11] =>  1:20
:END:
- [X] study circle pdf (downloaded on phone)
- [X] derive ellipse pk1 (prashant sent in messenger GC)
- [ ] maybe try pk2 if free time after lab reports
- [ ] notes & cards? maybe do some other day
*** DONE <2024-01-03 Wed> docs: CG lab 3: BSA :1:
SCHEDULED: <2024-01-08 Mon> DEADLINE: <2024-01-09 Tue>
:PROPERTIES:
:Copy_num: sem5-rough 1
:Page_range: 1
:Effort:   1h15min
:END:
:LOGBOOK:
CLOCK: [2024-01-08 Mon 15:22]--[2024-01-08 Mon 15:47] =>  0:25
CLOCK: [2024-01-08 Mon 13:35]--[2024-01-08 Mon 14:23] =>  0:48
:END:
*** DONE <2024-01-09 Tue> docs: CG Lab 4: Midpoint circle algorithm :offline:1:
SCHEDULED: <2024-01-15 Mon 06:35> DEADLINE: <2024-01-16 Tue>
:PROPERTIES:
:Copy_num: sem5-rough 1, /lab/4/
:Page_range: 20
:END:
:LOGBOOK:
CLOCK: [2024-01-15 Mon 07:38]--[2024-01-15 Mon 08:43] =>  1:05
CLOCK: [2024-01-15 Mon 06:00]--[2024-01-15 Mon 07:08] =>  1:08
CLOCK: [2024-01-14 Sun 06:13]--[2024-01-14 Sun 06:32] =>  0:19
:END:
**** DONE write down formulae for ellipse here for next lab
:LOGBOOK:
CLOCK: [2024-01-15 Mon 10:19]--[2024-01-15 Mon 10:42] =>  0:23
CLOCK: [2024-01-15 Mon 09:17]--[2024-01-15 Mon 10:14] =>  0:57
:END:
**** DONE practice derivation
:LOGBOOK:
CLOCK: [2024-01-14 Sun 08:00]--[2024-01-14 Sun 08:38] =>  0:38
CLOCK: [2024-01-14 Sun 06:32]--[2024-01-14 Sun 07:07] =>  0:35
:END:
*** DONE <2024-02-09 Fri> docs: CG Lab 5: Ellipse
SCHEDULED: <2024-02-25 Sun> DEADLINE: <2024-02-27 Tue>
:LOGBOOK:
CLOCK: [2024-02-26 Mon 19:29]--[2024-02-26 Mon 19:38] =>  0:09
CLOCK: [2024-02-26 Mon 17:41]--[2024-02-26 Mon 19:15] =>  1:34
CLOCK: [2024-02-26 Mon 13:55]--[2024-02-26 Mon 14:40] =>  0:45
:END:
in messenger group chat (use OCR screenshot)
*** DONE <2024-02-16 Fri> docs: CG Lab 6: 2D transformations
SCHEDULED: <2024-02-25 Sun> DEADLINE: <2024-02-27 Tue>
:PROPERTIES:
:Copy_num: sem5-rough 1
:Page_range: 76, lab/6/ folder
:END:
:LOGBOOK:
CLOCK: [2024-02-26 Mon 19:38]--[2024-02-26 Mon 20:30] =>  0:52
:END:
- report instructions in copy
*** DONE CG lab 7 
SCHEDULED: <2024-02-28 Wed>
:LOGBOOK:
CLOCK: [2024-02-28 Wed 18:11]--[2024-02-28 Wed 18:33] =>  0:22
:END:
program file in messenger / outlook
***** DONE 2 (area fill, boundary fill) :1:
:LOGBOOK:
CLOCK: [2024-03-30 Sat 19:07]--[2024-03-30 Sat 19:26] =>  0:19
:END:
***** DONE 9 (refresh rate & persistence, architecture of random scan ) :1:
:LOGBOOK:
CLOCK: [2024-03-30 Sat 18:53]--[2024-03-30 Sat 18:59] =>  0:06
CLOCK: [2024-03-30 Sat 17:19]--[2024-03-30 Sat 17:46] =>  0:27
:END:
***** DONE 2 (applications of CG) :1:
:LOGBOOK:
CLOCK: [2024-03-30 Sat 18:59]--[2024-03-30 Sat 19:02] =>  0:03
:END:
*** [[https://drive.google.com/file/d/1Mj1vykJ40IePMlkRIxKpOCLtuvsN6Dlv/view][2021]]
:LOGBOOK:
CLOCK: [2023-12-31 Sun 17:29]--[2023-12-31 Sun 18:32] =>  1:03
:END:
***** DONE 2 (horizontal retrace, random scan architecture) :1:
:LOGBOOK:
CLOCK: [2024-03-30 Sat 19:03]--[2024-03-30 Sat 19:06] =>  0:03
:END:
**** DONE [#A] CN lab report 1
SCHEDULED: <2023-12-07 Thu> DEADLINE: <2023-12-09 Sat>
:LOGBOOK:
CLOCK: [2023-12-09 Sat 19:42]--[2023-12-09 Sat 20:21] =>  0:39
CLOCK: [2023-12-09 Sat 18:27]--[2023-12-09 Sat 19:29] =>  1:02
:END:
**** DONE read "Critiques of OSI & TCP/IP" section in Tanenbaum's networking book (notes in pg.107-108 if needed)
DEADLINE: <2023-12-13 Wed>
:LOGBOOK:
CLOCK: [2023-12-13 Wed 15:37]--[2023-12-13 Wed 16:13] =>  0:36
CLOCK: [2023-12-13 Wed 14:59]--[2023-12-13 Wed 15:25] =>  0:26
:END:
- [X] send pdf to shweta

  
**** DONE solve past questions for CN1
SCHEDULED: <2023-12-14 Thu> DEADLINE: <2023-12-15 Fri>
:LOGBOOK:
CLOCK: [2023-12-15 Fri 20:12]--[2023-12-15 Fri 20:32] =>  0:20
CLOCK: [2023-12-15 Fri 19:16]--[2023-12-15 Fri 20:01] =>  0:45
:END:
- do repeat questions only once
- do in loose sheet or separate copy
*** DONE [#B] <2024-01-07 Sun> docs: CN Lab 2
DEADLINE: <2024-02-04 Sun>
:LOGBOOK:
CLOCK: [2024-01-13 Sat 16:28]--[2024-01-13 Sat 16:43] =>  0:15
CLOCK: [2024-01-13 Sat 14:08]--[2024-01-13 Sat 14:57] =>  0:49
:END:
*** DONE [#A] <2024-01-14 Sun> docs: CN [[id:f6283bf1-2a5c-413a-b37c-548edfc490bb][Lab 3]]
:PROPERTIES:
:Copy_num: sem5-rough 1
:Page_range: 34-35
:ID:       b1cd0bba-c057-4904-96d0-7070d7ba0006
:END:
:LOGBOOK:
CLOCK: [2024-02-18 Sun 00:38]--[2024-02-18 Sun 01:28] =>  0:50
CLOCK: [2024-02-15 Thu 20:43]--[2024-02-15 Thu 21:03] =>  0:20
CLOCK: [2024-02-15 Thu 20:11]--[2024-02-15 Thu 20:30] =>  0:19
:END:
- handwritten? idk
- only theory needed about router setup (hostname, interfaces, etc.)
  no need for CLI commands

*** DONE <2024-02-18 Sun> docs: CN Lab 5: physical setup of router & switch
SCHEDULED: <2024-02-24 Sat> DEADLINE: <2024-02-25 Sun>
:LOGBOOK:
CLOCK: [2024-02-24 Sat 20:09]--[2024-02-24 Sat 21:15] =>  1:06
CLOCK: [2024-02-24 Sat 19:14]--[2024-02-24 Sat 20:04] =>  0:50
CLOCK: [2024-02-24 Sat 18:08]--[2024-02-24 Sat 18:49] =>  0:41
:END:
- [ ] make report after last lab?
   to see if any new stuff taught & combine into one report if needed
some [[id:27c54578-65f2-4bee-82ca-c05f7797f28e][notes here]]
- [ ] look up switch, ip address conventions, on what basis to set address, subnet masks
*** [[https://drive.google.com/file/d/1AKcUxyyuLvlG4pn2_VBcfjTXWEJzd9sg/view][2021]]
:LOGBOOK:
CLOCK: [2023-12-31 Sun 17:29]--[2023-12-31 Sun 18:32] =>  1:03
:END:
***** DONE [#C] MAN presentation (info in copy) :bored:
DEADLINE: <2024-02-02 Fri>
:PROPERTIES:
:ID:       59902837-9f7d-405b-a8a5-0d9469a3a413
:END:
:LOGBOOK:
CLOCK: [2024-02-17 Sat 05:37]--[2024-02-17 Sat 06:41] =>  1:04
:END:
topic: ch.6 from Total Quality Management till end
